In [427]:
import pandas as pd, numpy as np

In [428]:
df = pd.read_csv('data.csv')
data = pd.read_csv('/home/developer/Desktop/data.csv', index_col=0)

# Data Cleaning

In [429]:
df['Date'] = pd.to_datetime(df['Date'], format='mixed')
df.dropna(subset='Date', inplace=True)
df.loc[7, 'Duration'] = 45
x = df['Calories'].mean()
df['Calories'].fillna(x, inplace=True)

In [430]:
data.reset_index(inplace=True)

In [431]:
data.rename(columns = {'DoB':'Date of Birth'}, inplace=True)
data

   Sno.          Name   Age   Salary Date of Birth
0     1  Ashish Yadav  22.0  15000.0      26/04/02
1     2          Anil  23.0  10000.0      20/02/02
2     3         Aswan  21.0  20000.0      27/05/02
3     4       Harshit   NaN  15000.0           NaN
4     5       Sandeep  25.0      NaN      09/02/96
5     6          Ajay  26.0      NaN      28/02/98
6     7       Bhawesh  23.0  20000.0        110811
7     8           NaN  30.0  80000.0      19981205

In [432]:
df.sample(frac=0.1)
df.sample(n=5)
df.nlargest(5, 'Calories')
df.nsmallest(5, 'Calories')

    Duration       Date  Pulse  Maxpulse  Calories
8         30 2020-12-09    109       133     195.1
16        60 2020-12-16     98       120     215.2
27        60 2020-12-27     92       118     241.0
20        45 2020-12-20     97       125     243.0
31        60 2020-12-31     92       115     243.0

# Indexing

# Query

In [433]:
df.query('Duration > 45')
data.query('Salary > 10000')
data.dropna(subset='Name', inplace=True)
data.query('Name.str.startswith("As")', engine="python")

   Sno.          Name   Age   Salary Date of Birth
0     1  Ashish Yadav  22.0  15000.0      26/04/02
2     3         Aswan  21.0  20000.0      27/05/02

In [434]:
df[df['Duration'] > 45]
data[data['Salary'] > 10000]
data[data.Name.str.startswith('As')]

   Sno.          Name   Age   Salary Date of Birth
0     1  Ashish Yadav  22.0  15000.0      26/04/02
2     3         Aswan  21.0  20000.0      27/05/02

# Where Method

Where Method return a Series of the same shape as the original:

In [435]:
data[data['Salary'] > 10000]

   Sno.          Name   Age   Salary Date of Birth
0     1  Ashish Yadav  22.0  15000.0      26/04/02
2     3         Aswan  21.0  20000.0      27/05/02
3     4       Harshit   NaN  15000.0           NaN
6     7       Bhawesh  23.0  20000.0        110811

In [436]:
data.where(data['Salary'] > 10000)

   Sno.          Name   Age   Salary Date of Birth
0   1.0  Ashish Yadav  22.0  15000.0      26/04/02
1   NaN           NaN   NaN      NaN           NaN
2   3.0         Aswan  21.0  20000.0      27/05/02
3   4.0       Harshit   NaN  15000.0           NaN
4   NaN           NaN   NaN      NaN           NaN
5   NaN           NaN   NaN      NaN           NaN
6   7.0       Bhawesh  23.0  20000.0        110811

In [437]:
dates = pd.date_range('1/1/2000', periods=8)
dt = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
dt[dt < 0]

                   A         B         C   D
2000-01-01       NaN       NaN       NaN NaN
2000-01-02       NaN       NaN       NaN NaN
2000-01-03 -0.698921 -0.831860 -0.823730 NaN
2000-01-04 -0.123054       NaN -0.556613 NaN
2000-01-05       NaN       NaN -1.430712 NaN
2000-01-06 -0.051743       NaN -0.520972 NaN
2000-01-07       NaN -0.324077 -0.834679 NaN
2000-01-08       NaN       NaN       NaN NaN

where takes an optional other argument for replacement of values where the condition is False, in the returned copy.

In [438]:
dt.where(dt < 0, -dt)

                   A         B         C         D
2000-01-01 -0.186582 -0.285665 -0.788776 -1.304337
2000-01-02 -1.576819 -0.859265 -0.506898 -0.813811
2000-01-03 -0.698921 -0.831860 -0.823730 -0.647745
2000-01-04 -0.123054 -0.509386 -0.556613 -0.032539
2000-01-05 -0.182851 -0.759647 -1.430712 -0.805176
2000-01-06 -0.051743 -0.379173 -0.520972 -1.651805
2000-01-07 -1.903456 -0.324077 -0.834679 -0.876831
2000-01-08 -1.299503 -0.092618 -0.843921 -0.010620

# Summary Function

In [439]:
data.nunique()
data.shape

(7, 5)

In [440]:
data['Salary'].value_counts()

Salary
15000.0    2
20000.0    2
10000.0    1
Name: count, dtype: int64

In [441]:
data.loc[:, ['Age', 'Salary']].sum()

Age         140.0
Salary    80000.0
dtype: float64

# Multi Indexing

From Tuples

In [442]:
lst = [
    ('tech', 1),
    ('tech', 2),
    ('tech', 3),
    ('tech', 4),
    ('tech', 5),
    ('Non-tech', 1),
    ('Non-tech', 2),
    ('Non-tech', 3),
    ('Non-tech', 4),
    ('Non-tech', 5),
]
index = pd.MultiIndex.from_tuples(lst, names=['Dept.', 'Sno.'])
names = ['Ashish', 'Anil', 'Aswan', 'Abhishek', 'Ayush', 'Ajay', 'Bhawesh', 'Himanshu', 'Sandeep', 'Sourabh']
employee = pd.DataFrame(names, index=index, columns=['Name'])
employee

                   Name
Dept.    Sno.
tech     1       Ashish
         2         Anil
         3        Aswan
         4     Abhishek
         5        Ayush
Non-tech 1         Ajay
         2      Bhawesh
         3     Himanshu
         4      Sandeep
         5      Sourabh

From Datafrmes

In [443]:
df1 = pd.DataFrame([['bar', 1], ['bar', 2], ['foo', 1], ['foo', 2]], columns=['first', 'second'])
l = pd.MultiIndex.from_frame(df1)

In [444]:
print(l)
print(l.names)

MultiIndex([('bar', 1),
            ('bar', 2),
            ('foo', 1),
            ('foo', 2)],
           names=['first', 'second'])
['first', 'second']

In [445]:
employee.loc[[['tech', 2], ['tech', 3], ['Non-tech', 3], ['Non-tech', 2]]]

                   Name
Dept.    Sno.
tech     2         Anil
         3        Aswan
Non-tech 3     Himanshu
         2      Bhawesh

In [446]:
employee.index.is_monotonic_increasing

False

In [447]:
employee.sort_index(level=0, inplace=True)

In [448]:
employee.index.is_monotonic_increasing

True